#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time   : 2020/7/25 17:11
# @Author : Zh
# @Project : yk_wx
# @File   : notice_map.py
# @Software: PyCharm

WEATHER_DATA = {
    "WEATHER_1": ["晴", "平静", "微风", "和风", "清风", "有风"],
    "WEATHER_2": ["晴间多云", "阴", "少云", "多云"],
    "WEATHER_3": ["疾风", "大风", "烈风", "风暴", "狂爆风", "飓风", "热带风暴"],
    "WEATHER_4": ["霾", "中度霾", "重度霾", "严重霾"],
    "WEATHER_5": ["阵雨", "小雨", "毛毛雨/细雨", "雨", "雷阵雨"],
    "WEATHER_6": ["中雨", "大雨", "暴雨", "大暴雨", "特大暴雨", "极端降雨", "小雨-中雨", "中雨-大雨", "大雨-暴雨", "暴雨-大暴雨", "大暴雨-特大暴雨"],
    "WEATHER_7": ["雨雪天气", "雨夹雪", "阵雨夹雪", "冻雨", "雪", "阵雪", "小雪"],
    "WEATHER_8": ["中雪", "大雪", "暴雪", "小雪-中雪", "中雪-大雪", "大雪-暴雪"],
    "WEATHER_9": ["浮尘", "扬沙", "沙尘暴", "小强沙尘暴", "龙卷风"],
    "WEATHER_10": ["雾", "浓雾", "强浓雾", "轻雾", "大雾", "特强浓雾"],
    "WEATHER_11": ["热"],
    "WEATHER_12": ["冷"],
}

NOTICE_MAP = {
    "WEATHER_1": ["天气较好，谨防紫外线侵扰", "好的天气需要配一个好的心情", "阳光明媚，愿你心情也如花一样灿烂"],
    "WEATHER_2": ["不要被乌云挡住好心情", "云虽多，换个角度你可以少打遮阳伞了", "天空虽有云，但你心中应晴空万里"],
    "WEATHER_3": ["风力较大，请注意保暖", "风大的时候，我们懂得了多吃点的重要性", "底盘稳是不是有时候也是件好事"],
    "WEATHER_4": ["霾较大，请带好口罩，做好防护", "霾较大，减少不必要的出行", "雾霾较大，请注意来往车辆"],
    "WEATHER_5": ["雨虽小，请带好雨伞", "毛毛细雨，也不要大意", "小雨不大，带上雨伞也未必不可"],
    "WEATHER_6": ["大雨将至，务必带好雨伞，必要时记住打车回家", "雨水较大，请做好防护", "大雨或许跟打车更配哦"],
    "WEATHER_7": ["小雪飘飘，请勿留恋", "雪天虽美，请不要太过留恋", "雪天很美，愿你心情更美"],
    "WEATHER_8": ["大雪飞扬，不要挡住了你的视野，注意安全", "大雪将至，请注意防滑", "减少出行，室内赏雪，美滋滋"],
    "WEATHER_9": ["扬沙较大，带好口罩", "口罩准备好了吗？", "如果可以请呆在室内"],
    "WEATHER_10": ["雾气较大，请看清前方道路", "路上小心，注意来往车辆", "路上请勿玩手机，注意安全"],
    "WEATHER_11": ["今天较热，减少不必要的外出", "高温预警，避免中暑", "温度虽高，空调不适宜温度态度"],
    "WEATHER_12": ["寒风凛凛，注意保暖", "天气变冷，多穿衣服，远离感冒", "多穿衣服，身体才是最重要的"]
}
